while not (n := input("Enter the number from 1 to 999: ")).isdigit() or not(1 <= int(n) <= 999): pass

units = ["", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"]
teens = ["", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"]
tens = ["", "десять", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"]
hundreds = ["", "сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"]

n=int(n)

h = n // 100
t = (n // 10) % 10
u = n % 10

if t == 1 and u != 0:
    print(f"{hundreds[h]} {teens[u]}".strip())
else:
    print(f"{hundreds[h]} {tens[t]} {units[u]}".strip())